In [21]:
import pandas as pd
from bisect import bisect_left

In [22]:
cbse_no_dup = pd.read_csv("cbse_gender_names_list.csv")
cbse_df = pd.read_csv("cbse_data_with_duplicates.csv")

In [23]:
print(cbse_no_dup.shape)
print(cbse_df.shape)

(205545, 3)
(388846, 3)

In [24]:
def get_freq_and_percent_df(df, column_name):
    freq_df = df[column_name].value_counts()
    return freq_df

In [25]:
def print_gender_count_stats(df, df_nodup):
    stats_without_duplicates = get_freq_and_percent_df(df, 'Gender')
    stats = get_freq_and_percent_df(df_nodup, 'Gender')
    x = ['Male', 'Female']
    print('CBSE DATA: \n')
    print(f'1. Actual Statistics: \n')
    print(stats.head())
    print(f'2. After Removing duplicates: \n')
    print(stats_without_duplicates.head())

In [26]:
print_gender_count_stats(cbse_no_dup, cbse_df)

CBSE DATA:

1. Actual Statistics:

Boy     194423
Girl    194423
Name: Gender, dtype: int64
2. After Removing duplicates:

Boy     114089
Girl     91456
Name: Gender, dtype: int64

Why after dropping duplicates sizes have differed? Same student means same parents?

In [73]:
c.drop_duplicates().sort_values('freq',ascending=False)[350:].head(30)

                     Name  Gender  freq  male_freq  female_freq
199815  ASHOK KUMAR SINGH    Male  64.0       64.0          NaN
15620        SARITA SINGH  Female  64.0        NaN         64.0
318259         SAROJ JAIN    Male  64.0        1.0         63.0
3481         RADHA SHARMA  Female  63.0        NaN         63.0
536         ANITA AGARWAL  Female  63.0        NaN         63.0
197753  SANJAY KUMAR JAIN    Male  63.0       63.0          NaN
60510        SANJAY SINGH  Female  63.0       62.0          1.0
198558      SANTOSH YADAV    Male  63.0       13.0         50.0
1520        SANTOSH YADAV  Female  63.0       13.0         50.0
197838      DEEPAK SHARMA    Male  63.0       62.0          1.0
201339         ANIL GUPTA    Male  63.0       63.0          NaN
5032         SUMAN KANWAR  Female  63.0        NaN         63.0
6253        DEEPAK SHARMA  Female  63.0       62.0          1.0
198049       SANJAY SINGH    Male  63.0       62.0          1.0
197479          AJAY JAIN    Male  63.0       63.0          NaN
1246               SUSHMA  Female  62.0        NaN         62.0
3258           USHA GUPTA  Female  62.0        NaN         62.0
198135      BHANWAR SINGH    Male  62.0       62.0          NaN
1383         VANDANA JAIN  Female  62.0        NaN         62.0
429             RENU JAIN  Female  62.0        NaN         62.0
1969              SANDHYA  Female  62.0        NaN         62.0
195121            KAILASH    Male  62.0       47.0         15.0
6130          MOHINI DEVI  Female  62.0        NaN         62.0
201217     RAJENDRA GUPTA    Male  62.0       62.0          NaN
198508   ANIL KUMAR SINGH    Male  62.0       62.0          NaN
199211      PRADEEP KUMAR    Male  62.0       62.0          NaN
2675       KALPANA SHARMA  Female  62.0        NaN         62.0
198307         DILIP JAIN    Male  62.0       62.0          NaN
5110         PARVATI DEVI  Female  62.0        NaN         62.0
199164   RAJ KUMAR SHARMA    Male  62.0       62.0          NaN

In [67]:
cbse_df.drop_duplicates().sort_values('freq',ascending=False).head(30)

                 Name Gender   freq
1200      SUNITA DEVI   Girl  494.0
722            SUNITA   Girl  439.0
322873  SUNITA SHARMA    Boy  436.0
240     SUNITA SHARMA   Girl  436.0
3688     SANTOSH DEVI   Girl  410.0
2884       MANJU DEVI   Girl  409.0
244271     GEETA DEVI    Boy  363.0
2934       GEETA DEVI   Girl  363.0
2919       KAMLA DEVI   Girl  361.0
2831      SUNITA JAIN   Girl  336.0
234375    SUNITA JAIN    Boy  336.0
2975     ANITA SHARMA   Girl  306.0
2814       SEEMA JAIN   Girl  297.0
3423     MANJU SHARMA   Girl  292.0
4192       SAROJ DEVI   Girl  284.0
197265    SANJAY JAIN    Boy  279.0
3457     SUSHILA DEVI   Girl  277.0
707           SANTOSH   Girl  275.0
195596        SANTOSH    Boy  275.0
1980            ANITA   Girl  274.0
3653       ANITA DEVI   Girl  265.0
4008       ANITA JAIN   Girl  262.0
243391     SUMAN DEVI    Boy  244.0
2599       SUMAN DEVI   Girl  244.0
22      SANGEETA JAIN   Girl  237.0
134901    RAJESH JAIN   Girl  229.0
194445    RAJESH JAIN    Boy  229.0
706       PUSHPA DEVI   Girl  228.0
196661  RAJESH SHARMA    Boy  226.0
12897   RAJESH SHARMA   Girl  226.0

In [27]:
#  Get a df with name, frequency and gender 
# print(len(list(input['Gender']=='Boy') and list(input['Gender']=='Girl')))
# print(len(list(input['Gender']=='Girl')))
# print(input[list(input['Gender']=='Boy')].shape)
# print(input[list(input['Gender']=='Girl')].shape)
# print(input[list(input['Gender']=='Boy') and list(input['Gender']=='Girl')].head())
# df1 = input.groupby('Name').count()
print(cbse_df['Name'].value_counts())

SUNITA DEVI             494
SUNITA                  439
SUNITA SHARMA           436
SANTOSH DEVI            410
MANJU DEVI              409
                       ...
GOVIND RAM VERMA          1
DEVIDAS INDAIT            1
SONDEI SAINI              1
HARNAM SINGH THAKUR       1
KAMAL KUMAR BAKLIWAL      1
Name: Name, Length: 204544, dtype: int64

In [58]:
c['male_freq'] = 0
c['female_freq'] = 0

In [66]:
c[c['Gender']=='Female'].head()

             Name  Gender  freq  male_freq  female_freq
0  RAJSHREE DIWAN  Female   1.0        NaN          1.0
1     JYOTHI JAIN  Female   1.0        NaN          1.0
2       NITU JAIN  Female   4.0        NaN          4.0
3     SARIKA JAIN  Female  17.0        NaN         17.0
4   KETKI JOSHINA  Female   1.0        NaN          1.0

In [61]:
c['female_freq'] = c['Name'].map(c[c['Gender']=='Female']['Name'].value_counts())

In [64]:
c['male_freq'] = c['Name'].map(c[c['Gender']=='Male']['Name'].value_counts())

In [14]:
input['frequency'] = input['Name'].map(input['Name'].value_counts())

In [19]:
input[input['frequency']>1][input['Gender']=='Boy'].shape

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

(1000, 4)

In [ ]:
input['frequency']

In [12]:
df1.loc['SHANTI JAIN'].Gender
freq_df = input.groupby('Name').count()
cbse_df['freq'] = 0
for i in range(cbse_df.shape[0]):
    try :
        cbse_df.freq.loc[i] =  df1.loc[cbse_df['Name'][i]].Gender
    except:
        print('i', cbse_df.loc[i])

/usr/local/lib/python3.7/dist-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

i Unnamed: 0          304970
Name          BALWAN SINGH
Gender                 Boy
freq                     1
Name: 304970, dtype: object
i Unnamed: 0      348500
Name          SARJERAO
Gender             Boy
freq                 0
Name: 348500, dtype: object
i Unnamed: 0                     356038
Name          GAJENDRA SINGH SIKARWAR
Gender                            Boy
freq                                0
Name: 356038, dtype: object
i Unnamed: 0    368731
Name             NaN
Gender           Boy
freq               0
Name: 368731, dtype: object

In [ ]:
m_df = cbse_df[cbse_df['Gender']=='Girl'][cbse_df['freq']==2]
f_df = cbse_df[cbse_df['Gender']=='Boy'][cbse_df['freq']==2]
print(m_df.shape)
print(f_df.shape)

                        Name Gender
91456      VIMAL KANT SHUKLA    Boy
91457           VISHNU GURVE    Boy
91458   GOVIND SINGH CHAUHAN    Boy
91459       LILADHAR SINGHAL    Boy
91460         MAHAVIR AJMERA    Boy
...                      ...    ...
205540       DAYA RAM JAKHAR    Boy
205541   RADHEY SHYAM SHARMA    Boy
205542     DINESH CHHAPARWAL    Boy
205543              R K SONI    Boy
205544       MUKESH SILODIYA    Boy

[114089 rows x 2 columns]

In [ ]:
print_gender_count_stats(input, cbse_df)

CBSE DATA:

1. Actual Statistics:

[194423, 194423]
2. After Removing duplicates:

Boy     114089
Girl     91456
Name: Gender, dtype: int64

Questions:
Similar questions for first name and with complete name.
1. What are Top 5 female and male names?
2. How many names are both male and female?
3. What is the female and male ratio of the dataset

In [ ]:
def print_top_5_male_female_common_names(cbse_df):
    Male_df=cbse_df.groupby(['Gender']).get_group('Boy')
    Female_df=cbse_df.groupby(['Gender']).get_group('Girl')
    Male_df_freq = get_freq_and_percent_df(Male_df, 'Name')
    Female_df_freq = get_freq_and_percent_df(Female_df, 'Name')
    print('Most frequent Male Names:')
    print(Male_df_freq.head())
    print('Most frequenct Female Names:')
    print(Female_df_freq.head())

    print('Most common names used in both genders:')
    # update it to use frequency counts
    male_names = list(set(Male_df.Name.astype(str)))
    female_names = list(set(Female_df.Name.astype(str)))
    common = []

    male_names.sort()
    female_names.sort()

    # # optimized way sort and do a binary search
    for elem in male_names:
#         i = bisect_left(female_names, elem)
#         if i!= len(female_names) and female_names[i]==elem:
#             common.append(elem)
        if elem in female_names:
            common.append(elem)

In [ ]:
def extract_first_name_last_name(cbse_df):
    cbse_df['namelen']= [len(str(i)) for i in cbse_df['Name']]
    cbse_df = cbse_df[(cbse_df['namelen'] >= 2) ]
    cbse_df['first_name'] = [str(name).split(' ')[0]  for name in cbse_df['Name']]
    cbse_df['last_name'] = [' '.join(str(name).split(" ")[1:]) for name in cbse_df['Name']]

In [ ]:
first_names = pd.DataFrame(cbse_df['first_name'])
first_names['Gender'] = cbse_df['Gender']
print(first_names.shape)

In [ ]:
first_names.head()

In [ ]:
Male_df=first_names.groupby(['Gender']).get_group('Boy')
Female_df=first_names.groupby(['Gender']).get_group('Girl')
# print(Male_df.groupby('first_name').count().sort_values(by="Gender", ascending=False).head())
# print(Female_df.groupby('first_name').count().sort_values(by='Gender', ascending=False).head())
print(Male_df['first_name'].value_counts().head())
print(Female_df['first_name'].value_counts().head())

In [ ]:
Male_df = Male_df.drop_duplicates()
Female_df = Female_df.drop_duplicates()

In [ ]:
Male_df['last_letter'] = [str(name)[-1] for name in Male_df['first_name']]
# Male_df['last_but_one_letter'] = [str(name)[-2] for name in Male_df['first_name']]
Female_df['last_letter'] = [str(name)[-1] for name in Female_df['first_name']]

In [ ]:
print(Male_df.head())
print(Male_df.shape)
print(Female_df.head())
print(Female_df.shape)

In [ ]:
Female_list = Female_df['last_letter'].value_counts().sort_index().to_list() / Female_df['last_letter'].value_counts().sum()
Male_list = Male_df['last_letter'].value_counts().sort_index().to_list()[2:-2] / Male_df['last_letter'].value_counts().sum()

In [ ]:
X = ['A', 'B', 'C', 'D' , 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q' , 'R' , 'S', 'T', 'U', 'V', 'W','X','Y','Z']

In [ ]:
import numpy as np 
import matplotlib.pyplot as plt 
  
X_axis = np.arange(len(X))
  
plt.bar(X_axis - 0.2, Female_list, 0.4, label = 'Female')
plt.bar(X_axis + 0.2, Male_list, 0.4, label = 'Male')
  
plt.xticks(X_axis, X)
plt.xlabel("Last char of first name")
plt.ylabel("Percentage of students(cbse data)")
# plt.title("Number of Students in each group")
plt.legend()
plt.show()

In [ ]:
Male_df['last_2_letter'] = [str(name)[-2:] for name in Male_df['first_name']]
# Male_df['last_but_one_letter'] = [str(name)[-2] for name in Male_df['first_name']]
Female_df['last_2_letter'] = [str(name)[-2:] for name in Female_df['first_name']]

In [ ]:
ml = Male_df['last_2_letter'].value_counts().sort_index()
fl = Female_df['last_2_letter'].value_counts().sort_index()
heat_map_values = []
for i in range(0,26):
    arr = []
    for j in range(0,26):
        string = X[i]+X[j]
        if string in fl.index:
            f = fl[string]
        else: f = 0
            
        if string in ml.index:
            m = ml[string]
        else: m = 0
            
        if m == 0:
            prob = 1
        elif f == 0:
            prob = 0
        else: prob = f/(f+m)
#         prob = fl[string]/(fl[string]+ml[string])
        arr.append(prob)
    heat_map_values.append(arr)

In [ ]:
import seaborn as sns
plt.figure(figsize = (10,10))
sns.heatmap(heat_map_values, xticklabels=X, yticklabels=X, linewidth = .1)

In [ ]:
Female_list = Female_df['last_letter'].value_counts().sort_index().to_list() / Female_df['last_letter'].value_counts().sum()
Male_list = Male_df['last_letter'].value_counts().sort_index().to_list()[2:-2] / Male_df['last_letter'].value_counts().sum()

### Seperate Data Processing

In [42]:
import pandas as pd
import numpy as np
import json
import csv

In [44]:
def replace_none(test_dict):
  
    # checking for dictionary and replacing if None
    if isinstance(test_dict, dict):
        
        for key in test_dict:
            if test_dict[key] is None:
                test_dict[key] = {}
            else:
                replace_none(test_dict[key])
  
    # checking for list, and testing for each value
    elif isinstance(test_dict, list):
        for val in test_dict:
            replace_none(val)

In [45]:
cbse_2014 = pd.read_json('cbse_data_2014.json', orient='index')
cbse_2015 = pd.read_json('cbse_data_2015.json', orient='index')
cbse_2014.to_json('test_2014.json',orient='records')
cbse_2015.to_json('test_2015.json', orient='records')

with open('test_2014.json') as f:
    data_2014 = json.load(f)

with open('test_2015.json') as f:
    data_2015 = json.load(f)
    
        
replace_none(data_2014)
replace_none(data_2015)

cbse_2014_df_st = pd.json_normalize(data_2014)
cbse_2015_df_st = pd.json_normalize(data_2015)

In [46]:
cbse_2014_df_st.to_csv('2014_complete_data.csv')
cbse_2015_df_st.to_csv('2015_complete_data.csv')

In [49]:
c1 = pd.DataFrame()
c1['Name'] = cbse_2014_df_st['mother_name']
c1['Gender'] = 'Female'
c2 = pd.DataFrame()
c2['Name'] = cbse_2015_df_st['mother_name']
c2['Gender'] = 'Female'
c3 = pd.DataFrame()
c3['Name'] = cbse_2014_df_st['father_name']
c3['Gender'] = 'Male'
c4 = pd.DataFrame()
c4['Name'] = cbse_2015_df_st['father_name']
c4['Gender'] = 'Male'
c = pd.concat([c1, c2, c3, c4], ignore_index = True)

In [52]:
c.shape

(388846, 2)

In [ ]:
def extract_first_name_last_name(cbse_df, column_name):
    cbse_df[column_name+'_namelen']= [len(str(i)) for i in cbse_df[column_name]]
    cbse_df = cbse_df[(cbse_df[column_name+'_namelen'] >= 2) ]
    cbse_df[column_name+'_first_name'] = [str(name).split(' ')[0]  for name in cbse_df[column_name]]
    cbse_df[column_name+'_last_name'] = [' '.join(str(name).split(" ")[1:]) for name in cbse_df[column_name]]
    return cbse_df

In [ ]:
def get_freq_and_percent_df(df, column_name):
    freq_df = df[column_name].value_counts().to_frame()
    freq_df['percent'] = df[column_name].value_counts()/df[column_name].value_counts().sum()
    return freq_df

In [ ]:
def get_freq_df(df, column_name):
    freq_df = df[column_name].value_counts()
    return freq_df

## Correlation in frequency of names from students to parents

In [ ]:
cbse_2014_df = extract_first_name_last_name(cbse_2014_df_st, 'name')
cbse_2015_df = extract_first_name_last_name(cbse_2015_df_st, 'name')
cbse_2014_df = extract_first_name_last_name(cbse_2014_df, 'mother_name')
cbse_2014_df = extract_first_name_last_name(cbse_2014_df, 'father_name')
cbse_2015_df = extract_first_name_last_name(cbse_2015_df, 'father_name')
cbse_2015_df = extract_first_name_last_name(cbse_2015_df, 'mother_name')

In [ ]:
cbse_2014_df.head()

,roll_no,name,mother_name,father_name,result,ENGLISH CORE.sub_code,ENGLISH CORE.sub_name,ENGLISH CORE.theory,ENGLISH CORE.marks,ENGLISH CORE.grade,...,F.AID& EMER.M.CARE.grade,name_namelen,mother_name_namelen,father_name_namelen,name_first_name,name_last_name,mother_name_first_name,mother_name_last_name,father_name_first_name,father_name_last_name
0,1610001,PRIYA DIWAN,RAJSHREE DIWAN,PARESHKUMAR DIWAN,PASS,301,ENGLISH CORE,95.0,95.0,A1,...,NaN,11,14,17,PRIYA,DIWAN,RAJSHREE,DIWAN,PARESHKUMAR,DIWAN
1,1610002,AKSHITA JAIN,JYOTHI JAIN,HEMENDRA JAIN,PASS,301,ENGLISH CORE,91.0,91.0,A2,...,NaN,12,11,13,AKSHITA,JAIN,JYOTHI,JAIN,HEMENDRA,JAIN
2,1610003,NIDHI JAIN,NITU JAIN,DINESH JAIN,PASS,301,ENGLISH CORE,79.0,79.0,B2,...,NaN,10,9,11,NIDHI,JAIN,NITU,JAIN,DINESH,JAIN
3,1610004,SAMIKSHA JAIN,SARIKA JAIN,SUNDER JAIN,PASS,301,ENGLISH CORE,95.0,95.0,A1,...,NaN,13,11,11,SAMIKSHA,JAIN,SARIKA,JAIN,SUNDER,JAIN
4,1610005,NISHI JOSHINA,KETKI JOSHINA,ANAND JOSHINA,PASS,301,ENGLISH CORE,83.0,83.0,B1,...,NaN,13,13,13,NISHI,JOSHINA,KETKI,JOSHINA,ANAND,JOSHINA

In [ ]:
cbse_2014_student = get_freq_and_percent_df(cbse_2014_df, 'name_first_name')
cbse_2014_mother = get_freq_and_percent_df(cbse_2014_df, 'mother_name_first_name')
cbse_2014_father = get_freq_and_percent_df(cbse_2014_df, 'father_name_first_name')
cbse_2014_parent = cbse_2014_mother.append(cbse_2014_father)

In [ ]:
cbse_2014_student_ln = get_freq_and_percent_df(cbse_2014_df, 'name_last_name')
cbse_2014_mother_ln = get_freq_and_percent_df(cbse_2014_df, 'mother_name_last_name')
cbse_2014_father_ln = get_freq_and_percent_df(cbse_2014_df, 'father_name_last_name')

cbse_2015_student_ln = get_freq_and_percent_df(cbse_2015_df, 'name_last_name')
cbse_2015_mother_ln = get_freq_and_percent_df(cbse_2015_df, 'mother_name_last_name')
cbse_2015_father_ln = get_freq_and_percent_df(cbse_2015_df, 'father_name_last_name')

In [ ]:
def get_top_and_bottom(df, n):
    df1 = df.head(n)
    df1 = df1.append(df.tail(n))
    return df1

In [ ]:
s14_s = get_top_and_bottom(cbse_2014_student_ln, 5)
s14_m = get_top_and_bottom(cbse_2014_mother_ln, 5)
s14_f = get_top_and_bottom(cbse_2014_father_ln, 5)
s15_s = get_top_and_bottom(cbse_2015_student_ln, 5)
s15_m = get_top_and_bottom(cbse_2015_mother_ln, 5)
s15_f = get_top_and_bottom(cbse_2015_father_ln, 5)

In [ ]:
from IPython.display import display_html
from itertools import chain,cycle
def display_side_by_side(*args,titles=cycle([''])):
    html_str=''
    for df,title in zip(args, chain(titles,cycle(['</br>'])) ):
        html_str+='<th style="text-align:center"><td style="vertical-align:top">'
        html_str+=f'<h2>{title}</h2>'
        html_str+=df.to_html().replace('table','table style="display:inline"')
        html_str+='</td></th>'
    display_html(html_str,raw=True)

In [ ]:
display_side_by_side(s14_s,s14_m, s14_f, titles=['Student Surname','Mother Surname', 'Father Surname'])

,name_last_name,percent
SHARMA,4910,0.048420
JAIN,4173,0.041152
SINGH,3801,0.037484
GUPTA,2259,0.022277
KUMAR,2147,0.021173
AMBEDKAR,1,0.000010
JEET SINGH SIDDHU,1,0.000010
KUMAR MADDESHIYA,1,0.000010
RAUTKAR,1,0.000010
S MACWAN,1,0.000010
,mother_name_last_name,percent
DEVI,9079,0.089533
,7681,0.075747
SHARMA,5065,0.049949
JAIN,3913,0.038588
SINGH,2663,0.026261
CHAUTHWANI,1,0.000010
FATMA KHAN,1,0.000010
KISHORI,1,0.000010
KARODIWAL,1,0.000010
S MACWAN,1,0.000010
,father_name_last_name,percent
SINGH,5799,0.057187
,3623,0.035728
SHARMA,2784,0.027455
JAIN,2435,0.024013
KUMAR,2214,0.021833
K PORWAL,1,0.000010
POUL,1,0.000010
JETHI,1,0.000010
SINGH DUGAR,1,0.000010
KRISHNA MITTAL,1,0.000010

In [ ]:
display_side_by_side(s15_s,s15_m, s15_f, titles=['Student Surname','Mother Surname', 'Father Surname'])

,name_last_name,percent
SHARMA,4540,0.048807
JAIN,3732,0.040121
SINGH,3546,0.038121
GUPTA,2163,0.023253
KUMAR,2138,0.022985
NAJA JAIN,1,0.000011
HATAI,1,0.000011
SHALINI,1,0.000011
BEHURA,1,0.000011
MANJUL KHARE,1,0.000011
,mother_name_last_name,percent
DEVI,8656,0.093056
,6397,0.068771
SHARMA,4671,0.050216
JAIN,3522,0.037863
SINGH,2436,0.026188
CHALISE,1,0.000011
DANGWAL,1,0.000011
MANI BARLA,1,0.000011
MEHMOODA,1,0.000011
KALA MEHRA,1,0.000011
,father_name_last_name,percent
SINGH,5336,0.057365
,2680,0.028811
SHARMA,2544,0.027349
JAIN,2120,0.022791
KUMAR,1969,0.021168
K MANDWARYA,1,0.000011
DAS CHETWANI,1,0.000011
SINGH KIROLA,1,0.000011
RAO G V V S N,1,0.000011
KISHORE MEHTO,1,0.000011

In [ ]:
c14s = get_freq_df(cbse_2014_df, 'name_first_name')
c14m = get_freq_df(cbse_2014_df, 'mother_name_first_name')
c14f = get_freq_df(cbse_2014_df, 'father_name_first_name')
c14p = c14m.append(c14f)

c15s = get_freq_df(cbse_2015_df, 'name_first_name')
c15m = get_freq_df(cbse_2015_df, 'mother_name_first_name')
c15f = get_freq_df(cbse_2015_df, 'father_name_first_name')
c15p = c15m.append(c15f)

In [ ]:
print('c14s - c14p: Spearman', c14s.corr(c14p, method='spearman') )
print('c14s - c14m: Spearman', c14s.corr(c14m, method='spearman') )
print('c14s - c14f: Spearman', c14s.corr(c14f, method='spearman') )
print('c15s - c15p: Spearman', c14s.corr(c15p, method='spearman') )
print('c15s - c15m: Spearman', c14s.corr(c15m, method='spearman') )
print('c15s - c15f: Spearman', c14s.corr(c15f, method='spearman') )
print('c14s - c14p: Pearson', c14s.corr(c14p) )
print('c14s - c14m: Pearson', c14s.corr(c14m) )
print('c14s - c14f: Pearson', c14s.corr(c14f) )
print('c15s - c15p: Pearson', c14s.corr(c15p) )
print('c15s - c15m: Pearson', c14s.corr(c15m) )
print('c15s - c15f: Pearson', c14s.corr(c15f) )

c14s - c14p: Spearman 0.37379760720518157
c14s - c14m: Spearman 0.37551644085993363
c14s - c14f: Spearman 0.38379926866290515
c15s - c15p: Spearman 0.35360237609058826
c15s - c15m: Spearman 0.3553801921322891
c15s - c15f: Spearman 0.36259193288460534
c14s - c14p: Pearson 0.14132634572271588
c14s - c14m: Pearson 0.0816157086743922
c14s - c14f: Pearson 0.20609627334300576
c15s - c15p: Pearson 0.12853117491156407
c15s - c15m: Pearson 0.07254837792677309
c15s - c15f: Pearson 0.18904464125858295

In [ ]:
marks_col = []
for col in cbse_2014_df.columns:
    if "marks" in col:
        marks_col.append(col)
        
print(marks_col)

['ENGLISH CORE.marks', 'ECONOMICS.marks', 'MATHEMATICS.marks', 'BUSINESS STUDIES.marks', 'ACCOUNTANCY.marks', 'PHYSICAL EDUCATION.marks', 'PHYSICS.marks', 'CHEMISTRY.marks', 'COMPUTER SCIENCE.marks', 'BIOLOGY.marks', 'INFORMATICS PRAC..marks', 'HINDI CORE.marks', 'HISTORY.marks', 'GEOGRAPHY.marks', 'PAINTING.marks', 'HIND.MUSIC VOCAL.marks', 'PSYCHOLOGY.marks', 'ENTREPRENEURSHIP.marks', 'POLITICAL SCIENCE.marks', 'URDU CORE.marks', 'HOME SCIENCE.marks', 'SOCIOLOGY.marks', 'HISTORY W/O PR..marks', 'HIND MUSIC.INS.PER.marks', 'MULTIMEDIA & WEB T.marks', 'APP/COMMERCIAL ART.marks', 'SCULPTURE.marks', 'ENGG. GRAPHICS.marks', 'HINDI ELECTIVE.marks', 'ENGLISH ELECTIVE.marks', 'GEOSPATIAL TECH.marks', 'TYPOGRAPHY &CA ENG.marks', 'HIND.MUSIC MEL.INS.marks', 'BUS.STUDIES W/O PR.marks', 'ENGLISH ELECTIVE-C.marks', 'CARNATIC MUSIC VOC.marks', 'FOOD SERVICE.marks', 'FOOD& BEV C & CNTL.marks', 'HUMAN RIGHTS & G S.marks', 'AGRICULTURE.marks', 'INTG.TRNSPRT OPER..marks', 'SANSKRIT CORE.marks', 'DANCE-BHARATNATYAM.marks', 'DANCE-KATHAK.marks', 'BIOTECHNOLOGY.marks', 'GRAPHIC DESIGN.marks', 'FASHION STUDIES.marks', 'MARKETING(OLD SYL).marks', 'BASIC PATTERN DEV..marks', 'THEATRE STUDIES.marks', 'CAP.MARKET OPRTNS.marks', 'DERIVATIV MKT OPER.marks', 'NAT. CADET CORPS.marks', 'LEGAL STUDIES.marks', 'CAR.MUSIC INS(MEL).marks', 'B P O SKILLS.marks', 'MARKETING.marks', 'PUNJABI.marks', 'URDU ELECTIVE.marks', 'SANSKRIT ELECTIVE.marks', 'LIB.SYS & RES.MGT.marks', 'COST ACCOUNTING.marks', 'FRENCH.marks', 'FOOD PRODUCTIONIII.marks', 'FOOD PRODUCTION IV.marks', 'EVOL & FORMS M M.marks', 'CRTV &COM.PROC M M.marks', 'LGSTCS,OPER&SUP CH.marks', 'B CONCEPT-H &MED T.marks', 'F.AID& EMER.M.CARE.marks']

In [ ]:
c14_s_m_maths = pd.DataFrame()
c14_s_m_maths['Mathematics'] = cbse_2014_df['MATHEMATICS.marks']
c14_s_m_maths['Name'] = cbse_2014_df['name']

In [ ]:
for index, row in cbse_2014_df.iterrows():
    print(index, row)
    break

0 roll_no                             1610001
name                            PRIYA DIWAN
mother_name                  RAJSHREE DIWAN
father_name               PARESHKUMAR DIWAN
result                                 PASS
                                ...
name_last_name                        DIWAN
mother_name_first_name             RAJSHREE
mother_name_last_name                 DIWAN
father_name_first_name          PARESHKUMAR
father_name_last_name                 DIWAN
Name: 0, Length: 432, dtype: object

## Correlation between Student and Marks

In [ ]:
import math

# Get student names and marks
c14_scores = pd.DataFrame()
c14_scores['name'] = cbse_2014_df['name']
c14_scores['marks'] = 0.0
for index, row in cbse_2014_df.iterrows():
    count = 0
    score = 0
    for col in marks_col:
        if math.isnan(row[col]) == False:
            count = count+1
            score = score + row[col]
#             print(row[col])
    if count == 0:
        avg = 0
    else:
        avg = score/count
#     print(avg)
    c14_scores['marks'][index] = avg  
#     break

/tmp/ipykernel_1032250/2024200589.py:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c14_scores['marks'][index] = avg

In [ ]:
c14_scores.head()

            name  marks
0    PRIYA DIWAN   93.4
1   AKSHITA JAIN   89.8
2     NIDHI JAIN   63.6
3  SAMIKSHA JAIN   93.4
4  NISHI JOSHINA   88.8

In [ ]:
c14_scores = extract_first_name_last_name(c14_scores, 'name')

In [ ]:
c14_scores.head()

            name  marks  name_namelen name_first_name name_last_name
0    PRIYA DIWAN   93.4            11           PRIYA          DIWAN
1   AKSHITA JAIN   89.8            12         AKSHITA           JAIN
2     NIDHI JAIN   63.6            10           NIDHI           JAIN
3  SAMIKSHA JAIN   93.4            13        SAMIKSHA           JAIN
4  NISHI JOSHINA   88.8            13           NISHI        JOSHINA

In [ ]:
sur_names = c14_scores.groupby('name_last_name')

In [ ]:
scores = sur_names['marks'].agg(np.mean)

In [ ]:
scores.sort_values(ascending = False)

name_last_name
TALUKA                 97.4
JOHN S                 97.4
GARAI                  97.2
KHATSURIYA             97.0
KUMAR JIGAR SANGHVI    96.8
                       ...
KAMLESH KUMAR DUBE      0.0
BAJIRAO PATIL           0.0
PAL SINGH SANDHU        0.0
HAMBIRE                 0.0
SINGH KAROL             0.0
Name: marks, Length: 16715, dtype: float64

In [ ]:
import math

marks_col = []
for col in cbse_2015_df.columns:
    if "marks" in col:
        marks_col.append(col)
        
# print(marks_col)

# Get student names and marks
c15_scores = pd.DataFrame()
c15_scores['name'] = cbse_2015_df['name']
c15_scores['marks'] = 0.0
for index, row in cbse_2015_df.iterrows():
    count = 0
    score = 0
    for col in marks_col:
        if math.isnan(row[col]) == False:
            count = count+1
            score = score + row[col]
#             print(row[col])
    if count == 0:
        avg = 0
    else:
        avg = score/count
#     print(avg)
    c15_scores['marks'][index] = avg  
#     break

c15_scores = extract_first_name_last_name(c15_scores, 'name')
sur_names = c15_scores.groupby('name_last_name')
scores = sur_names['marks'].agg(np.mean)
scores.sort_values(ascending = False)

/tmp/ipykernel_1032250/3204567860.py:27: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c15_scores['marks'][index] = avg

name_last_name
AMIR               97.4
D SHRIVASTAVA      97.2
TARTE              97.2
KUMARI DIGGI       96.8
MAHEEDHARAN        96.8
                   ...
MANISHA             0.0
KUMAR KISPOTTA      0.0
DAGAL               0.0
PRAKASH CHANDRA     0.0
KHURMI              0.0
Name: marks, Length: 15484, dtype: float64

In [ ]:
cbse_2015_df['father_name'].isna().sum()

0

In [ ]:
disp = pd.DataFrame()
disp['name'] = cbse_2015_df[cbse_2015_df['father_name'].isnull()]['name']
disp['mother_name'] = cbse_2015_df[cbse_2015_df['father_name'].isnull()]['mother_name']
disp['father_name'] = cbse_2015_df[cbse_2015_df['father_name'].isnull()]['father_name']

In [ ]:
disp

                    name           mother_name father_name
18269    MARIA E BHASKAR    KANINIKA BHATNAGAR         NaN
21496               PIHU         NIDHI SINGHAL         NaN
23499         DEVNA SHAH             JUHI SHAH         NaN
23521  K HITAISHI DRAVID       KAMILINI DRAVID         NaN
23522    K HIMANI DRAVID       KAMILINI DRAVID         NaN
29198       NAVNEET KAUR       SUKHWINDER KAUR         NaN
43452       ARPIT KAPOOR          SUMAN KAPOOR         NaN
50540     CHIRMAIE NAGDA          DIMPLE NAGDA         NaN
71015       ANANT VARMAN  VINDHYESHWARI KUMARI         NaN